<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
  <head>
<meta charset="utf-8">
<META NAME="keywords" CONTENT="Rodrigo Strauss, programador, programação, Visual C++, C#, Windbg, Device Driver">
<META NAME="description" CONTENT="Artigos sobre programação escritos por Rodrigo Strauss">
<META NAME="author" CONTENT="Rodrigo Strauss">
<META NAME="ROBOTS" CONTENT="ALL">
    <title>WebLog  ::::  Rodrigo Strauss :: 1bit</title>
    <link href="../../../1bit.css" type="text/css" rel="stylesheet">
    <link rel="alternate" type="text/xml" title="RSS" href="../../../weblog_rss.1bit">

  </head>
  <body bottommargin="0" leftmargin="0" topmargin="0" rightmargin="0">
    <table cellspacing="0" cellpadding="0" width="100%" border="0">
        <tr>
          <td class="header" valign="middle" bgcolor="#ffffff" height="77" colspan="2">&nbsp;
<a href="../../../"><img src="../../../images/logo_novo_2.png" border="0" /></a>

          </td>
        </tr>
        <tr>
          <td class="topmenu"></td>
          <td class="topmenu" align="right" height="30">

		    <a class="top_menu_link" href="../../../content.1bit/contact">Contato</a> 
			<span class="menusep">|</span>
            
            <a class="top_menu_link" href="../../../content.1bit/about">Sobre...</a>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          </td>
        </tr>
        <tr>
          <td class="topmenu"></td>
          <td>
          <table style="MARGIN: 0px" cellspacing="0" cellpadding="0" width="100%" border="0">
            <tr>
              <td><img src="../../../images/rebarba1.png"></td>
              <td align="right"><img src="../../../images/rebarba2.png"></td>
              </tr>
            </table>
          </td>
        </tr>
        <tr>
          <td class="menu" valign="top" width="175">

<div class="left_menu_section">
 <h2><a href="../../../#artigos" style="text-decoration:none;">Artigos</a></h2>
</div>

<div class="left_menu_section">
 <h2><a href="../../../content.1bit/weblog_archive" style="text-decoration:none;">Blog</a></h2>
</div>

<div class="left_menu_section">
 <h2><a href="../../../content.1bit/opensource" style="text-decoration:none;">Open Source</a></h2>
</div>

<!-- 
<div class="left_menu_section">
 <h2><a href="content.1bit/aulas" style="text-decoration:none;">Aulas online (ou não) </a></h2>
</div>
-->


<br>
<br>
<br>
<center>

<!--
<a href="http://whos.amung.us/show/xopqoakh"><img src="http://whos.amung.us/cwidget/xopqoakh/fffffff6915a.png" alt="page counter" width="81" height="29" border="0" /></a>
-->

</center>



<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
          </td>
          <td valign="top">
<div class="content">
<table width="100%" border="0">
<tr>
<td>
<h4><a href="../../../content.1bit/weblog_archive" style="text-decoration:none;">Rodrigo Strauss :::: WebLog</a></h4>
</td>

<td align="right">
<a style="text-decoration:none;" href="../../../content.1bit/weblog_archive">Arquivo</a><br><br>
<a style="text-decoration:none;" href="../../weblog_rss.1bit"><img src="../../../images/xml.gif" border="0"/></a>

</td>

</tr>
</table>
<h5><a class="weblog_link" href="content.1bit/weblog/1100578511">Novo artigo: Como ser um bom programador</a></h5><p>
Existem diversos fatores que levam algu&eacute;m a ser um bom programador. Selecionei os mais importantes e escrevi um artigo, sobre <a href="../../../content.1bit/bom_programador">como ser um bom programador</a>. Coloquei nele tamb&eacute;m algumas dicas importantes sobre como procurar informa&ccedil;&otilde;es na Internet e em lista de discuss&atilde;o. Al&eacute;m de lembrar que essa est&oacute;ria de "n&atilde;o preciso de livros, tem tudo na Internet" &eacute; coisas de gente que n&atilde;o sabe o que fala. :-)
</p>
<p class="datetime">Em 15/Nov/2004 20:15&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1100578511#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1100027624">Firefox 1.0!</a></h5><p>
Hoje, dia 09/11/2004 est&aacute; oficialmente lan&ccedil;ado o Mozilla Firefox 1.0
</p>

<p>
Eu uso o Firefox desde o 0.1 (quando ele ainda chamava Firebird), ele j&aacute; era muito bom desde aquela &eacute;poca. E est&aacute; ficando cada dia melhor. 
</p>

<p>
Caso voc&ecirc; ainda sofra com os demorados patches do Internet Explorer, sugiro que voc&ecirc; mude para o Firefox. Caso voc&ecirc; seja um power-user, mude para o Firefox e depois escolha as extens&otilde;es (plugins) que mais te agradam. Eu uso Ad-Block (bloqueia banners), Tabbrowser Extensions (melhor controle das tabs), Sage (leitor RSS), e o All-in-one Gesture (comande seu browser somente movendo o mouse). Resumindo: caso voc&ecirc; navegue na web, eu sugiro que voc&ecirc; use o Firefox!
</p>
<br>

<p>
<a href="http://getfirefox.com/" title="Get Firefox - The Browser, Reloaded">
<img src="http://www.mozilla.org/products/firefox/buttons/getfirefox_large.png" alt="Get Firefox" border="0" height="60" width="178"></a>

</p><p class="datetime">Em 09/Nov/2004 11:13&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1100027624#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1099891222">Realizando o meu desejo: Todos os posts do weblog, em ordem cronol&oacute;gica</a></h5><p>Eu leio <a href="../../../content.1bit/links">diversos weblogs</a> diariamente, e existe um recurso que eu sinto falta: poder ler todos os posts de um weblog em ordem cronol&oacute;gica. Em todos os blogs os posts s&atilde;o organizados no esquema de "os mais atuais primeiro", e quando algu&eacute;m escreve uma s&eacute;rie de posts relacionados, voc&ecirc; &eacute; obrigado a ficar lendo de tr&aacute;s para frente, como fazemos com rastros de e-mail. Ou pior, voc&ecirc; tem uma lista com os posts antigos e voc&ecirc; tem que clicar um por um. Alguns weblogs tem a funcionalidade de calend&aacute;rio, para que voc&ecirc; veja em uma tela s&oacute; os posts de um determinado m&ecirc;s. Sinceramente, a n&atilde;o ser que seja um weblog daqueles sentimentais ("hoje acordei feliz, o dia est&aacute; bonito e eu vesti aquela minha meia das Meninas Superpoderosas"), a data em que o post foi escrito pouco importa.</p>

<p>Como eu n&atilde;o posso modificar os weblogs dos outros, ent&atilde;o eu mudo o meu. Se voc&ecirc; quer ver tudo que eu escrevi at&eacute; hoje, e em ordem cronol&oacute;gica, <a href="../../../content.1bit/weblog?all_posts=yes">agora voc&ecirc; pode</a>. Um link para esse recurso tamb&eacute;m est&aacute; dispon&iacute;vel no <a href="../../../content.1bit/weblog_archive">arquivo do WebLog</a>.
</p><p class="datetime">Em 07/Nov/2004 21:20&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1099891222#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1099881681">Atendendo a pedidos: Controle de Contra&ccedil;&otilde;es para PC, baix&aacute;vel e feito em WTL</a></h5><p>
Atendendo aos <a href="../../../content.1bit/weblog/1099276836#comments">pedidos</a> do meu amigo Wanderley e da minha querida doula Ana Cris, resolvi fazer uma vers&atilde;o do meu <b><i>Programa Para Controle de Contra&ccedil;&otilde;es Para Parturientes e Similares</i></b> que roda em PC e feito em WTL. O layout do programa n&atilde;o &eacute; l&aacute; essas coisas, mas eu tentei manter o design e o funcionamento parecidos com a <a href="../../../content.1bit/weblog/1099276836">vers&atilde;o para PocketPC</a>. E apesar do pedido da Ana Cris para que o programa fosse "instal&aacute;vel", eu resolvi teimar e fazer um que n&atilde;o precisa instalar, &eacute; s&oacute; baixar e rodar. :-)
</p>

<p><center>
<img src="http://www.1bit.com.br/images/1099881681.png"/>
</center></p>

<p>
O programa foi desenvolvido usando o Visual C++ 7.1 e o WTL 7.5. Como eu n&atilde;o usei nada esot&eacute;rico, acredito que ele deve ser compil&aacute;vel usando vers&otilde;es mais antigas do WTL. Mesmo assim, n&atilde;o sei se isso vai compilar no Visual C++ 6.0.
</p>

<p>
Como em Win32 n&atilde;o existe DataGrid, eu usei um ListView, que serve muito bem para esse prop&oacute;sito. Ao inv&eacute;s de usar um DataSet para gravar os dados, eu usei um std::list e populei o ListView "na m&atilde;o".</p>

<p>
Foi dif&iacute;cil resistir a tenta&ccedil;&atilde;o de usar o ATL::CAtlList no lugar do std::list, mas eu estou querendo me livrar do v&iacute;cio do ATL e ser um pouquinho mais multiplataforma. Acho que eu nunca escrevi sobre isso ainda, mas eu me recuso a usar a lib do C. Eu gosto mesmo &eacute; de CreateFile, ATL::CAtlFile, CreateFileMapping, CoCreateInstance e CoMarshalInterThreadInterfaceInStream :-)
</p>

<p>
Olhem os trechos principais do c&oacute;digo:

<div class="code">
<pre>

typedef struct _CONTRA_INFO
{
   __time64_t StartTime;
   __time64_t EndTime;
} CONTRA_INFO;

typedef std::list&lt;CONTRA_INFO&gt; CContraList;

...

void CMainDlg::ChangeButtonText()
{
   m_Button.SetWindowText(m_bContraInProgress ?
                          _T("Ufa, acabou...") : 
                          _T("Est&aacute; doendo, socorro!!"));
}

void CMainDlg::UpdateList()
{
   CContraList::iterator CurrentIterator, PreviousIterator;
   int iItem;
   
   ATL::CTime CurrentTime, PreviousTime;
   ATL::CTimeSpan Duration, Interval;
 
   CurrentIterator = m_ContraList.end();
   CurrentIterator--;
   
   if(m_bContraInProgress)
   {
      //
      // contra&ccedil;&atilde;o acabou de iniciar. Calcular o intervalo entre 
      // a &uacute;ltima e colocar o hor&aacute;rio inicial no ListView
      //

      //
      // Colocar no ListView
      //
      CurrentTime = CurrentIterator->StartTime;
      iItem = m_lstContra.InsertItem(100000, CurrentTime.Format(_T("%x %X")));

      //
      // se for a primeira contra&ccedil;&atilde;o, n&atilde;o tem intervalo para calcular
      //
      if(CurrentIterator != m_ContraList.begin())
      {
         PreviousIterator = CurrentIterator;
         PreviousIterator--;
         

         ATLASSERT(PreviousIterator->EndTime != 0);
         Interval = CurrentIterator->StartTime - PreviousIterator->EndTime;

         m_TotalInterval += Interval.GetTimeSpan();

         m_lstContra.SetItemText(iItem,2,Interval.Format(_T("%M:%S")));
      }
   }
   else
   {
      //
      // a contra&ccedil;&atilde;o acabou. &Eacute; s&oacute; calcular a dura&ccedil;&atilde;o e colocar no &uacute;ltimo item
      //
      iItem = m_lstContra.GetItemCount() - 1;
      
      ATLASSERT(CurrentIterator->StartTime &amp; CurrentIterator->EndTime);
      Duration = CurrentIterator->EndTime - CurrentIterator->StartTime;

      m_TotalDuration += Duration.GetTimeSpan();

      m_lstContra.SetItemText(iItem,1,Duration.Format(_T("%M:%S")));
   }
}

void CMainDlg::DoStatistics()
{
   ATL::CTimeSpan t;
   int iItemCount = m_ContraList.size();
   
   if(iItemCount < 2)
      return;

   t = m_TotalDuration / (iItemCount - (m_bContraInProgress ? 1 : 0));
   m_stcDuration.SetWindowText(t.Format(_T("%H:%M:%S")));

   //
   // como o primeiro item n&atilde;o tem intervalo, &eacute; -1
   //
   t = m_TotalInterval / (iItemCount - 1);
   m_stcInterval.SetWindowText(t.Format(_T("%H:%M:%S")));
}

LRESULT CMainDlg::OnContraClick(WORD,WORD,HWND,BOOL&amp;)
{
   CONTRA_INFO ContraInfo;
   CContraList::iterator i;
   
   if(!m_bContraInProgress)
   {
      //
      // in&iacute;cio da contra&ccedil;&atilde;o
      //
      ContraInfo.StartTime = _time64(NULL);
      ContraInfo.EndTime = 0;

      m_bContraInProgress = TRUE;
      m_ContraList.push_back(ContraInfo);
   }
   else
   {
      ATLASSERT(!m_ContraList.empty());
      i = m_ContraList.end();
      i--;
      
      i->EndTime = _time64(NULL);
      m_bContraInProgress = FALSE;
   }

   UpdateList();
   ChangeButtonText();
   DoStatistics();
         
   return TRUE;
}
</pre>
</div>

<p>Algumas coisas podem ser notadas nesse trecho de c&oacute;digo:</p>
<ul>
<li>N&atilde;o acho que esse c&oacute;digo seja muito mais complicado do que um c&oacute;digo em .NET. Complicado e dif&iacute;cil de compreender &eacute; a lib do C, que tem mais de 3 d&eacute;cadas. ATL/WTL facilitam muito as coisas, e o c&oacute;digo fica MUITO pequeno e MUITO r&aacute;pido.</li>

<li>Eu n&atilde;o me preocupei com otimiza&ccedil;&otilde;es. O m&aacute;ximo que eu fiz &eacute; usar __time64_t ao inv&eacute;s de ATL::CTime na hora de gravar os hor&aacute;rios, para reduzir a atividade desenfreada de copy constructors. At&eacute; porque, hoje em dia todo mundo usa .NET, que &eacute; muuuuuuuuito lento (n&atilde;o me venham com esse papo de "depende"). Ent&atilde;o n&atilde;o me venham falar que meu c&oacute;digo em C++ poderia ser mais r&aacute;pido... :-)</li>

<li>Programar drivers faz bem! Quem j&aacute; programou KernelMode v&ecirc; a clara influ&ecirc;ncia do estilo WinDDK no meu c&oacute;digo. Uso de ASSERTS, c&oacute;digo claro, coment&aacute;rios claros e destacados, vari&aacute;veis com nomes claros. Olhe algum sample do DDK e veja o que &eacute; programar bonito!</li>

<li>Eu usei TCHAR (veja as macros _T()) para que eu pudesse compilar em UNICODE (Windows NT/2000/XP/2003) e em ANSI (Windows 9x/Me). No projeto existem 3 configura&ccedil;&otilde;es: Debug, Release e Release ANSI. Eu costumo compilar somente UNICODE, mas resolvi de &uacute;ltima hora ser solid&aacute;rio com os usu&aacute;rios de Win9x, afinal, eles j&aacute; t&ecirc;m problemas suficientes.</li>

<li>Eu coloquei o ATL:: antes de CTime e CTimeSpan para deixar bem claro que o c&oacute;digo n&atilde;o tem nada a ver com MFC.</li>

</ul>

<p>Como o programa &eacute; feito em WTL (a melhor lib do planeta para desenvolver c&oacute;digo Win32), n&oacute;s temos um execut&aacute;vel de 84kb sem depend&ecirc;ncia de nenhuma runtime ou DLL. &Eacute; s&oacute; baixar o execut&aacute;vel e rodar.</p>

<h6>Downloads</h6>
<a href="http://www.1bit.com.br/downloads/ContraWTL.exe">Execut&aacute;vel UNICODE (Windows NT/2000/XP/2003/Longhorn)</a>
<br>
<a href="http://www.1bit.com.br/downloads/ContraWTLA.exe">Execut&aacute;vel ANSI (Windows 9x/Me)</a>. Eu n&atilde;o tenho uma m&aacute;quina Windows 9x para testar, me avisem caso n&atilde;o funcione.
<br>
<a href="http://www.1bit.com.br/downloads/ContraWTL_src.zip">Fontes do programa</a>. Voc&ecirc; vai precisar do <a href="http://sourceforge.net/projects/wtl/">WTL</a> para compilar.
<p class="datetime">Em 07/Nov/2004 18:41&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1099881681#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1099606710">Programadores sepultam programas mortos</a></h5><p><del><a href="http://informatica.terra.com.br/interna/0,,OI416135-EI553,00.html">Terra Inform&aacute;tica: Programadores sepultam programas mortos</a></del></p>
<p><a href="http://developers.slashdot.org/article.pl?sid=04/11/04/019228">Slashdot: Programmers Hold Funerals for Old Code</a></p>
<p>Eu tenho tantos programas para chorar... Os meus pelo menos eu mantenho em estado de hiberna&ccedil;&atilde;o no meu HD, n&atilde;o tenho coragem de matar. Afinal, algum dia eu ainda posso querer modificar o programa em Clipper que eu fiz quando tinha 16 anos, vai saber...</p>
<p><b>Editado em 05/11/2004: Um link do Slashdot &eacute; muuuuuuuuuito melhor do que um link do Terra Inform&aacute;tica</b></a><p class="datetime">Em 04/Nov/2004 14:18&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1099606710#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1099520575">Existe alguma empresa onde isso n&atilde;o acontece?</a></h5><img src="http://www.dilbert.com/comics/dilbert/archive/images/dilbert2004114644029.gif"/>
<p>
Caso voc&ecirc; conhe&ccedil;a alguma empresa onde isso n&atilde;o aconte&ccedil;a, sinta-se a vontade para repassar <a href="http://www.1bit.com.br/curriculum.html">o meu curriculum</a>.
</p><p class="datetime">Em 03/Nov/2004 14:22&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1099520575#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1099457259">Programando drivers com bom humor</a></h5><p>Toda equipe sempre tem um programador que acaba colocando uma gracinha ou outra em um programa. Eu fa&ccedil;o quest&atilde;o de n&atilde;o deixar as equipes que eu participo sem esse tipo de pessoa. Al&eacute;m de ter o costume de colocar uns coment&aacute;rios n&atilde;o muito convencionais no c&oacute;digo, eu &agrave;s vezes aproveito para colocar um <a href="http://en.wikipedia.org/wiki/Easter_egg_(virtual)">ovinho de p&aacute;scoa</a> nos programas. O que seria da nossa vida sofrida de programador se n&atilde;o tivessemos bom humor?</p>

<p>
Olhem s&oacute; um erro que foi retornado pelo BUILD (programa que gerencia a compila&ccedil;&atilde;o de drivers) do DDK quando eu, por engano, coloquei um arquivo .h na lista de SOURCES:

<div class="code">
<pre>
BUILD: Adding /Y to COPYCMD so xcopy ops won't hang.
BUILD: Object root set to: ==> objchk_w2K_x86
BUILD: Compile and Link for i386
BUILD: Loading c:\WINDDK\3790\build.dat...
BUILD: Computing Include file dependencies:
BUILD: Examining d:\data\sp\source2\drivers\spfwu directory for files to compile.
    d:\data\sp\source2\drivers\spfwu 
BUILD: d:\data\sp\source2\drivers\spfwu: <b>Interesting sources extension: callbacks.h</b>
</pre>
</div>

<p>
Eu tamb&eacute;m acho que .h &eacute; uma extens&atilde;o bem interessante... :-)</p><p class="datetime">Em 02/Nov/2004 20:47&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1099457259#comments">Comentários (1)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1099427303">Novo servidor</a></h5><p>Depois de ficar realmente decepcionado com a instabilidade do meu antigo servidor, resolvi fazer uma troca. Espero que esse novo hosting fa&ccedil;a jus aos 97% de aprova&ccedil;&atilde;o e satisfa&ccedil;&atilde;o que eles conseguiram no <a href="http://www.findmyhosting.com">Find My Hosting</a>. A aprova&ccedil;&atilde;o do meu antigo era de 80%, talvez isso diga alguma coisa...
</p><p class="datetime">Em 02/Nov/2004 12:28&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1099427303#comments">Comentários (5)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1099300523">WinDbg novo!</a></h5><p>
<a href="http://www.microsoft.com/whdc/devtools/debugging/default.mspx">O WinDbg 6.4.4.4 beta j&aacute; est&aacute; dispon&iacute;vel para download</a>. Eu j&aacute; baixei o meu :-)
</p><p class="datetime">Em 01/Nov/2004 01:15&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1099300523#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1099276836">Um dia minha filha ter&aacute; orgulho disso</a></h5><p>
Minha pequena Heloisa nasceu faz um pouco mais de uma semana. Al&eacute;m da minha felicidade de pai de primeira viagem, isso tamb&eacute;m gerou uma hist&oacute;ria interessante para contar. Afinal, nada da vida de um escovador de bits pode passar em branco... :-)
</p>

<p>
Quem conhece um pouco de gravidez, sabe que horas antes (pode ser at&eacute; 48 horas) do parto, a mulher come&ccedil;a a sentir as contra&ccedil;&otilde;es e o corpo come&ccedil;a a se preparar para o trabalho de parto. As m&atilde;es que fazem pr&eacute; natal s&atilde;o orientadas pelos m&eacute;dicos e enfermeiras a anotar a dura&ccedil;&atilde;o e intervalo das contra&ccedil;&otilde;es, para saber como anda a evolu&ccedil;&atilde;o do trabalho e ajudar a saber a hora certa de ir para um Hospital (ou para uma Casa de Parto, como foi o meu caso).
</p>

<p>
Enquanto eu estava no trabalho, minha esposa ligou dizendo que j&aacute; estava sentindo algumas contra&ccedil;&otilde;es leves. E tamb&eacute;m me disse que estava controlando isso, anotando os hor&aacute;rio no papel. Poxa, no papel?? Nem uma planilhinha Excel?? Em que mundo vivemos?? :-)
</p>

<p>
Quando eu cheguei em casa, ouvi o que eu queria: "Ficar olhando no rel&oacute;gio e anotando essas contra&ccedil;&otilde;es j&aacute; est&aacute; enchendo o saco...". Foi a&iacute; que eu perguntei se um programinha no iPaq ajudava. Disse que seria s&oacute; clicar quando come&ccedil;asse e quando terminasse a contra&ccedil;&atilde;o, que ele faria o resto. Ent&atilde;o, ela disse sim. :-)
</p>

<p>
Abri feliz meu Visual Studio, iniciei um projeto para PocketPC em C#. Meia hora, um DataGrid, um DataSet e um Button depois, eu tinha uma vers&atilde;o alfa, que testamos nas pr&oacute;ximas contra&ccedil;&otilde;es. Corrigi alguns bugs e fui colocando mais recursos a medida que ela ia pedindo. Mais uma hora programando e acompanhando as contra&ccedil;&otilde;es eu tinha um programa para controlar contra&ccedil;&otilde;es pronto.
</p>

<p><center>
<img src="http://www.1bit.com.br/images/1099276836_1.png"/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<img src="http://www.1bit.com.br/images/1099276836_2.png"/>
</center>
</p>

<p>
A parte que est&aacute; no DataGrid &eacute; simples. Os tempos que est&atilde;o embaixo s&atilde;o as m&eacute;dias. O programa salva o DataSet em um arquivo "\contra.xml", e pergunta no in&iacute;cio se voc&ecirc; quer carreg&aacute;-lo para continuar contando as contra&ccedil;&otilde;es.
</p>

<p>Voc&ecirc; pode baixar os fontes do programa <a href="http://www.1bit.com.br/downloads/contra_src.zip">aqui</a>. Caso queria somente o programa para usar, voc&ecirc; pode <a href="http://www.1bit.com.br/downloads/contra.zip">baixar o programa</a>, instalar o <a href="http://www.microsoft.com/downloads/details.aspx?FamilyID=359ea6da-fc5d-41cc-ac04-7bb50a134556&amp;displaylang=en">.NET Compact Framework</a> no seu PocketPC e depois copiar o programa pra ele (n&atilde;o precisa instalar). E como ele &eacute; feito em .NET, esse programa tamb&eacute;m roda em qualquer PC que tenha o .NET Framework instalado (fica feio, mas roda).
<p>

<p>Acho desnecess&aacute;rio, mas l&aacute; vai:<br> <b>Esse programa &eacute; livre e pode ser usado por qualquer um, sem restri&ccedil;&otilde;es. Sendo assim, N&Atilde;O DAREI NENHUM TIPO DE SUPORTE. Tamb&eacute;m n&atilde;o me responsabilizo caso alguma conta esteja errada, n&atilde;o se esque&ccedil;a que eu programei isso enquanto minha esposa estava tendo contra&ccedil;&otilde;es... Tamb&eacute;m n&atilde;o me responsabilizo se algu&eacute;m parir em meia hora ou se a mulher passar o tempo todo jogando paci&ecirc;ncia no iPaq e n&atilde;o controlar as contra&ccedil;&otilde;es. E claro, ignorarei qualquer pedido para que o programa seja portado para VB.NET :-)</b></p><p class="datetime">Em 31/Oct/2004 18:40&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1099276836#comments">Comentários (7)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1098738297">Testando ASP.NET, rodando em Linux e Mono</a></h5><p>
O <a href="http://www.monoforge.com/">MonoForge</a>, uma iniciativa do provedor italiano <a href="http://www.impulso.it/">Impulso</a>, est&aacute; aceitando candidatos para um per&iacute;odo de beta test para hospedar aplicativos feito em ASP.NET. A grande novidade &eacute; que os servidores usar&atilde;o Linux e <a href="http://www.mono-project.com/about/index.html">Mono</a> (a runtime .NET para Linux/Unix/MacOS da Ximian/Novell), ao inv&eacute;s servidores com Windows. 
</p>

<p>
Ser&atilde;o 10MBs de espa&ccedil;o, e 1 banco mySQL. Sendo assim, voc&ecirc; n&atilde;o pode simplesmente copiar seu aplicativo ASP.NET feito para SQL Server e v&ecirc;-lo rodando, a n&atilde;o ser que voc&ecirc; tenha usado alguma camada para abstra&ccedil;&atilde;o de banco de dados. Mas como as classes de acesso a banco de dados suportam as interfaces IDbXXX, voc&ecirc; pode dar sorte, e um find/replace para trocar as declara&ccedil;&otilde;es pode resolver o seu problema - se voc&ecirc; n&atilde;o usou nenhum recurso esot&eacute;rico do SQL Server, &eacute; claro.
</p>

<p>
&Eacute; uma &oacute;tima oportunidade para testar o Mono sem usar um servidor pr&oacute;prio.
</p><p class="datetime">Em 25/Oct/2004 14:04&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1098738297#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1098321894">Se o programador &eacute; bom, n&atilde;o importa a ferramenta</a></h5><p>
Uma das caracter&iacute;sticas de um bom programador &eacute; saber escolher a ferramenta certa para a tarefa certa. Apesar de eu ser um ferrenho programador Visual C++, quando eu preciso fazer programinhas de cadastros eu uso VB6 ou .NET.
</p>

<p>
Mesmo assim, existem pessoas que fazem coisas muito boas, mesmo que a ferramenta n&atilde;o seja a mais adequada. Eu lembro que a uns 8 anos atr&aacute;s eu copiei da antiga revista Micro Sistemas (algu&eacute;m lembra dessa?) um driver de mouse para QBASIC, usando DATA e PEEK/POKE. Eu eu comecei a fazer um Adventure, com interface gr&aacute;fica e tudo, em QBASIC. Cheguei at&eacute; a fazer uma lib para interface tipo Windows, como bot&atilde;o 3D e um sistema tosco de caixas e coordenadas. Bons tempos aquele, quando eu nem sabia que programa&ccedil;&atilde;o era uma profiss&atilde;o, pra mim era tudo divers&atilde;o.
</p>

<p>
O fato &eacute;: a grande maioria dos softwares s&atilde;o feitos em C/C++. Apesar de serem linguagens altamente t&eacute;cnicas e muito complexas para iniciantes, a flexibilidade faz com que elas sejam as preferidas. J&aacute; falei sobre isso em um <a href="http://1bit.com.br/content.1bit/weblog/1092958476">post anterior</a>. Mas existem pessoas que que usam linguagens menos comuns - ou at&eacute; mesmo n&atilde;o adequadas - para contruir programas. Alguns exemplos:
</p>
<p>
<b><a href="http://bitconjurer.org/BitTorrent/">BitTorrent:</a></b> Software para downloads distribu&iacute;dos, uma das grandes inven&ccedil;&otilde;es em P2P. Um conceito maravilhoso, implementado em Python e com a GUI feita em <a href="http://www.wxwindows.org/">wxWindows</a>, usando um bind para Python.
</p>
<p>
<b><a href="http://azureus.sourceforge.net/">Azureus:</a></b>
Client para BitTorrent, feito em Java. N&atilde;o que Java n&atilde;o seja uma ferramenta adequada para isso, mas os programas GUI feitos em Java, na sua grande maioria, s&atilde;o muito feios. Esse programa (junto com o Eclipse e as IDEs da Borland) &eacute; muito bonito e funciona muito bem. &Eacute; meu client BitTorrent preferido.
</p> 
<p><b><a href="http://193.151.73.87/games/lemmings/">DHTML Lemmings:</a></b>
O CAMPE&Atilde;O!!! Link enviado pelo meu amigo <a href="http://www.kabloc.com.br/">F&aacute;bio</a>. Um clone do jogo Lemmings implementado em DHTML/CSS/JavaScript. Joguei s&oacute; as primeiras fases, mas o jogo &eacute; perfeito. Eu custei a acreditar que ele foi feito somente em JavaScript.
</p><p class="datetime">Em 20/Oct/2004 18:24&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1098321894#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1098259353">Mostre-me teu Menu Iniciar e digo quem tu &eacute;s</a></h5><center><img src="http://www.1bit.com.br/images/1098259353.png"/></center><p class="datetime">Em 20/Oct/2004 01:02&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1098259353#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1098237368">Wikipedia tem tudo, inclusive algoritmos</a></h5><p>
Quem leu o <a href="../../../content.1bit/about">About</a> do site deve saber o quanto eu gosto da Wikipedia. &Eacute; a enciclop&eacute;dia livre e aberta, com mais conte&uacute;do do que as enciclop&eacute;dias pagas. E como bastante gente que trabalha diretamente com programa&ccedil;&atilde;o escreve l&aacute; (at&eacute; eu j&aacute; escrevi algumas coisas...), existe bastante conte&uacute;do sobre programa&ccedil;&atilde;o.
</p>

<p>
Mas um das coisas mais legais &eacute; que a Wikipedia tem muita informa&ccedil;&atilde;o sobre algoritmos, inclusive com implementa&ccedil;&otilde;es em diversas linguagens. Duvido que a Barsa que sua m&atilde;e comprou tenha a implementa&ccedil;&atilde;o de quicksort em Lisp. :-)
</p>

<p>
Al&eacute;m da <a href="http://en.wikipedia.org/wiki/Algorithms">defini&ccedil;&atilde;o de um algoritimo</a>, temos a explica&ccedil;&atilde;o e implementa&ccedil;&atilde;o de 
<a href="http://en.wikipedia.org/wiki/Quick_sort">quick sort</a>,
<a href="http://en.wikipedia.org/wiki/binary_search">busca bin&aacute;ria</a>,
<a href="http://en.wikipedia.org/wiki/red_black_tree">red black tree</a>, entre outros. Fora os links para sites com mais detalhes e como anima&ccedil;&otilde;es Java para voc&ecirc; entender melhor o algoritmo. Precisa de mais alguma coisa?
</p>

<p class="datetime">Em 19/Oct/2004 18:56&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1098237368#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1098216963">Projeto de lei 1947/2003 sobre a regulamenta&ccedil;&atilde;o da profiss&atilde;o de Analista de Sistemas: eu sou contra!</a></h5><p>Existe um <a href="http://www.camara.gov.br/Internet/sileg/Prop_Detalhe.asp?id=132468">projeto de lei</a>, proposto por um deputado do Rio de Janeiro (Eduardo Paes), que prev&ecirc; a regulamenta&ccedil;&atilde;o da Profiss&atilde;o de Analista de Sistemas e a cria&ccedil;&atilde;o de um conselho, como a CREA, para os profissionais de inform&aacute;tica.</p>

<p>At&eacute; a&iacute;, tudo muito bom. At&eacute; ler <a href="http://www.camara.gov.br/sileg/integras/162085.htm">o conte&uacute;do da lei</a>:</p>

<p>
<i>
Art.2&ordm; Poder&atilde;o exercer a profiss&atilde;o de Analista de Sistema no Pa&iacute;s:
<br><br>
I - <b>os possuidores de diploma de n&iacute;vel superior em An&aacute;lise de Sistemas, Ci&ecirc;ncia da Computa&ccedil;&atilde;o ou Processamento de Dados</b>, expedidos no Brasil por escolas oficiais ou reconhecidas pelo Governo Federal;
<br>
II  os diplomados por escolas estrangeiras reconhecidas pelas leis de seu Pa&iacute;s e que revalidarem seus diplomas de acordo com a legisla&ccedil;&atilde;o em vigor;
<br>
III - os que, na data de entrada em vigor desta lei, tenham exercido, comprovadamente durante o per&iacute;odo de, no m&iacute;nimo 5(cinco) anos, a fun&ccedil;&atilde;o de Analista de Sistema e que requeiram o respectivo registro aos Conselhos Regionais de Inform&aacute;tica.
</i>
</p>

<p>E tem mais:</p>

<p>
<i>
Art.31 Constituem infra&ccedil;&otilde;es disciplinares, al&eacute;m de outras:
<br>
I -  transgredir preceito de &eacute;tica profissional;
<br>
II   exercer a profiss&atilde;o  <b>quando impedido de faz&ecirc;-lo</b>, ou facilitar, <b>por qualquer meio, o seu exerc&iacute;cio aos n&atilde;o inscritos ou impedidos</b>;

</i>
</p>
<p>N&atilde;o esque&ccedil;a que "impedido de faz&ecirc;-lo" &eacute; algu&eacute;m que n&atilde;o tenha diploma na &aacute;rea de inform&aacute;tica. E passar um projeto para uma pessoa n&atilde;o formada ser&aacute; uma infra&ccedil;&atilde;o pass&iacute;vel de puni&ccedil;&atilde;o.</p>

<p>
O deputado Eduardo Paes &eacute; advogado, ex Secret&aacute;rio do Meio Ambiente do Rio, e <a href="http://groups.yahoo.com/group/riojug_pl1947/message/188">assumidamente n&atilde;o entende de inform&aacute;tica</a>. N&atilde;o estou simplesmente o desqulificando, mas acho que a vis&atilde;o dele da nossa &aacute;rea &eacute; equivocada, ele est&aacute; tratando nossa &aacute;rea como se fosse Medicina e Engenharia. Inclusive, as pessoas que defendem a cria&ccedil;&atilde;o da lei insistem em fazer compara&ccedil;&otilde;es com essas &aacute;reas, que como sabemos, tem um din&acirc;mica completamente diferente da nossa. Eles chegam at&eacute; a dizer que tirando os "sem diploma" do mercado o sal&aacute;rio aumentar&aacute; gra&ccedil;as a lei da oferta e procura. Ego&iacute;smo pouco &eacute; bobagem mesmo...
</p>

<p>Eu j&aacute; gastei meu latim (sem sucesso) <a href="http://groups.yahoo.com/group/riojug_pl1947/">em uma lista de discuss&atilde;o sobre o assunto</a>, tentando explicar que tirar as pessoas sem diploma do mercado n&atilde;o &eacute; o mais correto. Sabemos que existem MUITOS analistas e programadores sem diploma que s&atilde;o MUITO melhores do que os formados. Al&eacute;m disso, me parece um instrumento visivelmente criado por algu&eacute;m que n&atilde;o tem conhecimento da &aacute;rea, e para profissionais limitados que querem manter seus empregos &agrave;s custas de um diploma. Querem criar mais um ind&uacute;stria dos "assinadores de projeto", como existe em jornalismo e engenharia. Talvez a regulamenta&ccedil;&atilde;o seja boa, mas o texto dessa lei est&aacute; completamente equivocado.</p>

<p>Criei uma <a href="http://groups.yahoo.com/group/naoregula/">lista de discuss&atilde;o para as pessoas que S&Atilde;O CONTRA essa lei</a>. Caso algu&eacute;m queira ajudar com argumentos, ou ajudar a pensar na forma mais adequada de manifesta&ccedil;&atilde;o para evitar que essa lei seja aprovada, sinta-se convidado. </p>

<p>Caso voc&ecirc; n&atilde;o conhe&ccedil;a direito a lei, d&ecirc; uma lida nela e nos seus apensos. Caso voc&ecirc; chegue a conclus&atilde;o que tamb&eacute;m &eacute; contra, entre na lista. Caso ainda n&atilde;o tenha opini&atilde;o formada ou deseje somente discutir o m&eacute;rito da quest&atilde;o, <a href="http://groups.yahoo.com/group/riojug_pl1947/">use a lista da RioJUG que foi criada para isso</a>. 
</p>

<p>
Parece que o pessoal da Sociedade Brasileira de Computa&ccedil;&atilde;o <a href="http://www.sbc.org.br/index.html?language=1&amp;subject=107">tamb&eacute;m &eacute; contra a exig&ecirc;ncia de diploma na &aacute;rea</a>. Fiquei muito feliz ao saber disso.
</p>

<h6>Para mais detalhes</h6>
<p><a href="http://www.camara.gov.br/sileg/integras/162085.htm">Texto do projeto de lei</a>
<br>
<a href="http://www.camara.gov.br/Internet/sileg/Prop_Detalhe.asp?id=132468">P&aacute;gina com todas as informa&ccedil;&otilde;es dos projetos.</a> Leia os apensos e veja as justificativas, voc&ecirc; dar&aacute; boas risadas
</p>







<p class="datetime">Em 19/Oct/2004 13:16&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1098216963#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1098158632">Sauda&ccedil;&otilde;es ao debutante</a></h5><p>
Alfred Gary Myers, o cara que mais entende de .NET que eu conhe&ccedil;o, resolveu de uma vez por todas escrever um <a href="http://br.thespoke.net/MyBlog/alfred_myers/MyBlog.aspx">blog</a>. V&atilde;o aqui meus votos para que ele realmente leve isso a s&eacute;rio e escreva freq&uuml;entemente.
</p><p class="datetime">Em 18/Oct/2004 21:03&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1098158632#comments">Comentários (2)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1097528827">Conhecimento &eacute; poder</a></h5><p>Eu j&aacute; <a href="../../../content.1bit/nao_ouca_ninguem">escrevi</a> sobre como &eacute; extremamente necess&aacute;rio que voc&ecirc; tenha informa&ccedil;&otilde;es para tomar decis&otilde;es. Tenho pensado bastante em open source, e resolvi me informar melhor de uma vez por todas. Eu sou um usu&aacute;rio Linux razo&aacute;vel, tenho um SUSE instalado em casa e at&eacute; consigo me virar. Bom, mas que gra&ccedil;a tem usar um sistema operacional sem program&aacute;-lo?</p>

<p>Al&eacute;m do C/C++, que &eacute; <i>lingua franca</i> em todos os sistemas operacionais, tendo estudado algumas bibliotecas. Fiz alguns testes com Qt (o toolkit usado pelo <a href="http://www.kde.org">KDE</a>) e tamb&eacute;m com GTK (usado pelo <a href="http://www.gnome.org">Gnome</a>). Tendo mais ao Qt, por ser nativamente C++ e por achar o KDE mais conciso do que o Gnome.</p>

<p>Al&eacute;m do C++, tenho feito testes com o <a href="http://www.mono-project.com">Mono</a>, a runtime .NET para Linux, do pessoal da Ximian/Novell. Apesar de toda a dificuldades com a implementa&ccedil;&atilde;o do Windows.Forms (eles tamb&eacute;m desistiram do Wine), o trabalho deles &eacute; espantoso. Nos poucos testes que eu fiz, o JIT do Mono me pareceu sensivelmente mais r&aacute;pido do que o JIT do .NET Framework. Ainda vou fazer alguns testes com sistemas maiores, mas a primeira impress&atilde;o &eacute; muito boa. Na empresa onde eu trabalho, estamos come&ccedil;ando a projetar um sistema grande, com a camada de neg&oacute;cios separada da apresenta&ccedil;&atilde;o. Isso vai me dar v&aacute;rios componentes sem depend&ecirc;ncia de Windows.Forms para testar no Mono. E prometo que publicarei os testes aqui no site.</p>

<p>Falando em Mono, eu troquei uns e-mails com o <a href="http://primates.ximian.com/~miguel/activity-log.html">Miguel de Icaza</a>, o cara que projetou e coordenou a implementa&ccedil;&atilde;o do Mono. O mais legal &eacute; que, em um dos e-mails, ele me deu uma "bronca", dizendo que o fato de <a href="../../../content.1bit/about">eu ter nascido no mundo Microsoft</a> n&atilde;o &eacute; um motivo para eu me sentir t&atilde;o perdido no UNIX ("n&atilde;o vou comprar seu argumento, simplesmente porque computadores s&atilde;o divertidos"). Al&eacute;m disso, ele me indicou um livro, o <a href="http://www.amazon.com/exec/obidos/ASIN/013937681X">The UNIX Programming Environment</a>, que eu comprei e estou lendo.

<p>Esse livro foi escrito em <a href="http://www.amazon.com/exec/obidos/ASIN/0451524934">1984</a>. Pode parecer desatualizado, n&atilde;o? &Eacute;, mas n&atilde;o est&aacute;. E lendo esse livro eu, al&eacute;m de aprender um pouco da filosofia do UNIX, tenho aprendido que as grandes novidades na &aacute;rea de programa&ccedil;&atilde;o s&atilde;o reinven&ccedil;&otilde;es de tudo que j&aacute; existe desde de 1960.</p>

<p>O UNIX trabalha com o conceito de stream, usando e abusando da capacidade de redirecionar o stdout de um programa para o stdin de outro (em portugu&ecirc;s: redireciona a sa&iacute;da de um programa para a entrada de outro). Esse conceito permite que v&aacute;rios programas trabalhem em conjunto, multiplicando o poder das ferramentas. Voc&ecirc; pode at&eacute; <a href="http://www.thinkgeek.com/tshirts/frustrations/374d/">trocar aquele funcion&aacute;rio incompetente por um shell script</a> :-).</p>

<p>Mas como um programa entende a sa&iacute;da de outro? Simples, usando o formato texto, com tudo separado com quebra de linha (\n). Assim todo mundo se entende. Isso te lembra alguma coisa? N&atilde;o mesmo? Pense melhor...

<p>XML. Padr&atilde;o baseado em SGML (texto) para interc&acirc;mbio de informa&ccedil;&otilde;es. Assim todo mundo se entende. Mas, considerando os fatos acima, XML &eacute; uma evolu&ccedil;&atilde;o, e n&atilde;o uma revolu&ccedil;&atilde;o. Seria uma revolu&ccedil;&atilde;o se todos os programas, desde o in&iacute;cio dos tempos, trabalhassem com formatos fechados e bin&aacute;rios, como o Microsoft Word. Mas &eacute; evolu&ccedil;&atilde;o, j&aacute; que isso j&aacute; existe desde a d&eacute;cada de 60.</p>

<p>Mais uma simples evolu&ccedil;&atilde;o: <a href="http://msdn.microsoft.com/architecture/soa/default.aspx">SOA</a>, arquitetura orientada a servi&ccedil;os. RPC baseado em SOAP (XML) trafegando em HTTP. Sem binding em tempo de compila&ccedil;&atilde;o = IDispatch. Sem guardar estado = programa&ccedil;&atilde;o procedural. Sim, isso mesmo, programa&ccedil;&atilde;o procedural. As fun&ccedil;&otilde;es s&atilde;o "abrigadas" em objetos, que simplesmente fazem o mesmo papel que um namespace C++. Isso vem desde o pooling de componentes do COM+, com objetos stateless (que n&atilde;o guardam estado). E a&iacute;, qual a revolu&ccedil;&atilde;o?</p>

<p>Conclus&otilde;es que eu cheguei:</p>
<ul>
<li>Evolu&ccedil;&atilde;o &eacute; uma palavra que s&oacute; serve para o pessoal de marketing</li>
<li>Sim, o Linux &eacute; legal... :-)</li>
<li>Como ler um livro pode fazer a gente pensar em tantas coisas</li>
<li>Como &eacute; colossal a quantidade de informa&ccedil;&otilde;es que voc&ecirc; pode absorver estudando sobre um assunto</li>
<li>Quando voc&ecirc; estuda um assunto, voc&ecirc; obt&ecirc;m informa&ccedil;&otilde;es que podem te levar a conclus&otilde;es sobre outros assuntos</li>
<li>Ainda bem que eu n&atilde;o virei advogado, como minha fam&iacute;lia queria...</li>
</ul><p class="datetime">Em 11/Oct/2004 14:07&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1097528827#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1097270254">Mais ferramentas</a></h5><p>Achei sites muito bons com ferramentas:</p>

<p><a href="http://lyon-smith.org/home.aspx">John Lyon-Smith</a>: Libs C++/Win32, libs .NET. Al&eacute;m disso, tem o "C# Script Executor 2.6.8", que permite usar C# como ferramenta de script.</p>

<p><a href="http://www.smidgeonsoft.com/">SmidgeonSoft</a>: Ferramentas <i>a la</i> Sysinternals. Debuggers, Disassemblers, e visualizadores de objetos do NT (threads, arquivos, etc). Merece uma visita.</p><p class="datetime">Em 08/Oct/2004 14:17&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1097270254#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1097268111">Mais uma prova que computa&ccedil;&atilde;o n&atilde;o &eacute; uma ci&ecirc;ncia exata</a></h5><p>A Microsoft, a um tempo atr&aacute;s, implementou a pol&iacute;tica "Zero Defects" para desenvolvimento de software. Essa pol&iacute;tica determinava que, enquanto todos os bugs de um determinado software n&atilde;o estivessem corrigidos, nenhuma nova funcionalidade seria adicionada. Mas os softwares da Microsoft (assim como 100% dos softwares existentes) ainda tem bugs. O que acontece ent&atilde;o? Leiam isso:</p>

<p><a href="http://weblogs.asp.net/larryosterman/archive/2004/10/06/238878.aspx">Larry's rules of software engineering, Part 3: "Zero Defects" doesn't result in zero defects</a></p>

<p class="datetime">Em 08/Oct/2004 13:41&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1097268111#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1097117982">MPROB (mais um post referenciando outro blog)</a></h5><p>O pessoal da Microsoft &agrave;s vezes exagera no uso de siglas:</p>

<p><a href=""http://www.gotdotnet.com/team/dbox/default.aspx?key=2004-08-26T07:48:08Z"">
Congrats to the XMLP WG for getting the MTOM and XOP specs to CR
</a></p>

<p>Algu&eacute;m pode me explicar o que o Don Box quis dizer com isso?? :-)</p>

<p class="datetime">Em 06/Oct/2004 19:59&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1097117982#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1097007424">Verdades e mitos sobre NTFS e FAT</a></h5><h6>Verdade: NTFS &eacute; mais seguro (quanto a perda de arquivos)</h6>
<p>O NTFS conta com um sistema de journaling, que grava um log de tudo que est&aacute; sendo modificado na estrutura da parti&ccedil;&atilde;o NTFS. Caso acabe a luz ou ocorra algum desastre similar, o NTFS termina (ou desfaz) as &uacute;ltimas modifica&ccedil;&otilde;es nos metadados da parti&ccedil;&atilde;o, deixando sua parti&ccedil;&atilde;o acess&iacute;vel. Quando acaba a luz e voc&ecirc; usa FAT, s&oacute; resta rezar enquanto religa m&aacute;quina.</p>
 
<h6>Mito: &Eacute; mais f&aacute;cil recuperar dados em uma parti&ccedil;&atilde;o FAT</h6>
<p>Esse mito vem do fato que os disquetes de boot DOS e Windows 9x n&atilde;o acessam parti&ccedil;&otilde;es NTFS. Mas as pessoas geralmente esquecem que os disquetes de boot j&aacute; n&atilde;o s&atilde;o essenciais. Todos os CDs do Windows 2000/XP podem ser usados para dar boot na m&aacute;quina e acessar os arquivos da parti&ccedil;&atilde;o usando a op&ccedil;&atilde;o de "Recovery".</p>

<p>Para esses casos espec&iacute;ficos tamb&eacute;m existem as distribui&ccedil;&otilde;es Linux que consegue fazer boot com interface gr&aacute;fica, conex&atilde;o com Internet e suporte a Pen Drive USB, tudo isso rodando diretamente do CD. Assim voc&ecirc; pode copiar seus arquivos tranquilamente. Algumas permitem que voc&ecirc; copie o Linux inteiro na RAM, retire o CD de boot e use o gravador de CD normalmente. A grande maioria das distribui&ccedil;&otilde;es Linux hoje em dia v&ecirc;m com o driver de NTFS (somente leitura). (A grande excess&atilde;o &eacute; o Fedora Core, mas eles devem ter algum motivo pol&iacute;tico/ideol&oacute;gico para isso...)</p>

<h6>Mito: FAT32 &eacute; mais r&aacute;pido do que NTFS</h6>
<p>Eu tamb&eacute;m tinha essa impress&atilde;o. O fato do driver de FAT do Windows chamar fastfat.sys tamb&eacute;m ajuda. Mas eu nunca encontrei nenhum estudo conclusivo que dissesse isso. O que eu mais encontrei na Internet foram informa&ccedil;&otilde;es de que o NTFS &eacute; mais r&aacute;pido do que o FAT em parti&ccedil;&otilde;es grandes. E como hoje em dia o menor HD que voc&ecirc; consegue comprar &eacute; de 80 GB...</p>

<h6>Mito: Parti&ccedil;&atilde;o NTFS n&atilde;o fica fragmentada</h6>
<p>Realmente, a parti&ccedil;&atilde;o NTFS tem bem menos problema com fragmenta&ccedil;&atilde;o. Mas n&atilde;o &eacute; verdade que NTFS n&atilde;o fragmenta. Tanto n&atilde;o &eacute; verdade que existe um desfragmentador no Windows.</p>

<h6>Veja tamb&eacute;m</h6>
<a href="../../../content.1bit/weblog/1091524453">
Dicas para particionamento e organiza&ccedil;&atilde;o do HD, parte 1</a><br>
<a href="../../../content.1bit/weblog/1093571241">
Dicas para particionamento e organiza&ccedil;&atilde;o do HD, parte 2</a><br>
<a href="../../../content.1bit/weblog/1095065027">
Dicas para particionamento e organiza&ccedil;&atilde;o do HD, parte 3</a><br><p class="datetime">Em 05/Oct/2004 13:17&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1097007424#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1096946690">Tudo que eu j&aacute; sabia</a></h5><p><a href="http://www1.folha.uol.com.br/folha/classificados/empregos/ult1671u2022.shtml">Para empresas, faltam profissionais qualificados na &aacute;rea de tecnologia</a></p>
<p class="datetime">Em 04/Oct/2004 20:24&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1096946690#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1095739330">Minha opini&atilde;o sobre open source e o governo</a></h5><p>Eu sou um programador que trabalha com tecnologia Microsoft. Uso Visual C++, C#. VB, SQL Server, etc. Gosto bastante dos softwares da Microsoft e o m&eacute;todo que eles usam para desenvolv&ecirc;-los. Mas n&atilde;o sou um defensor ferrenho da Microsoft. Existem alguns produtos deles que s&atilde;o ruins, eles tomam decis&otilde;es erradas e t&ecirc;m algumas posi&ccedil;&otilde;es pol&iacute;ticas pouco recomend&aacute;veis.</p>

<p>Como todo programador C/C++, sou bastante interessado pelo Linux. Programo em PHP e estou aprendendo Qt/GTK e Mono. Acho muito interessante que ele seja desenvolvido por programadores volunt&aacute;rios, que seja livre e com o c&oacute;digo aberto. Mas eu n&atilde;o me importo muito com a ideologia do Linux. Eu tento julg&aacute;-lo pela qualidade, e n&atilde;o pelo puritanismo de usar Linux s&oacute; pelo fato de n&atilde;o ser propriet&aacute;rio ou coisas assim. As empresas gastam dinheiro para desenvolver produtos e vend&ecirc;-los. E eles querem garantir o direito deles a essa inven&ccedil;&atilde;o/cria&ccedil;&atilde;o/descoberta usando patentes e coisas assim. Isso &eacute; absolutamente normal. (O sistema de patentes norte-americano &eacute; ruim e anormal, mas n&atilde;o vou falar disso agora). O software pode ser livre, mas a grande maioria dos outros bens de consumo (considerando que software &eacute; um bem) n&atilde;o s&atilde;o.</p>

<p>Eu sou contra a prefer&ecirc;ncia do governo por software livre. E sou absolutamente contra a exist&ecirc;ncia de qualquer lei nesse sentido, porque isso acaba com a concorr&ecirc;ncia. O crit&eacute;rio para escolha de software pelo poder p&uacute;blico deve ser o mesmo crit&eacute;rio que ele usa para qualquer coisa que compra: pre&ccedil;o e qualidade, custo e benef&iacute;cio. Ele n&atilde;o deve se prender a uma determinada "origem", seja ela o pessoal do open source, a Microsoft, a IBM ou qualquer outra empresa.</p>

<p>Al&eacute;m disso, com essa lei, o governo somente deixar&aacute; de comprar servi&ccedil;os de algumas empresas para comprar de outras. Por acaso a IBM ou RedHat s&atilde;o mais boazinhas do que a Microsoft s&oacute; porque promovem o Linux? O custo da licen&ccedil;a de um software &eacute; s&oacute; uma fra&ccedil;&atilde;o do seu custo ao longo do tempo. Al&eacute;m disso temos o custo de suporte e atualiza&ccedil;&atilde;o. Isso quer dizer que, ao inv&eacute;s do governo ficar amarrado com a Microsoft, ficar&aacute; amarrado com a IBM, RedHat, Conectiva ou qualquer empresa que trabalhe com Linux. &Eacute; correto privilegiar essas empresas e seus parceiros? Uma empresa que d&aacute; suporte (help desk) Linux n&atilde;o necessariamente contribui com a comunidade open source. Por que uma empresa dessas deve ter prefer&ecirc;ncia em detrimento de uma empresa que d&ecirc; suporte Windows?</p>

<p>Mas sim, hoje existe privil&eacute;gio por parte da Microsoft. As pessoas est&atilde;o t&atilde;o acostumadas a usar softwares Microsoft que muitas vezes n&atilde;o param para estudar se existe um alternativa que seja vi&aacute;vel. Isso sem contar o or&ccedil;amento de marketing da Microsoft. Se deve existir uma lei sobre escolha de software, ela deve exigir que o governo fa&ccedil;a um estudo de um numero m&iacute;nimo de alternativas de software para aquele problema espec&iacute;fico. Ent&atilde;o o governo vai comprar sistemas operacionais? Ok, ent&atilde;o que eles fa&ccedil;am um estudo da viabilidade de usar Linux ou Windows, estudar o custo-benef&iacute;cio da solu&ccedil;&atilde;o. O Linux &eacute; mais barato, mas tem problemas de compatibilidade com hardware e software. O Windows tem compatibilidade 100%, mas tem um alto custo com licen&ccedil;as e te deixa preso com somente um fabricante.</p>

<p>Resumindo, o crit&eacute;rio deve ser qualidade e custo-benef&iacute;cio. Querem que o Linux seja usado por todos? Fa&ccedil;am com que ele tenha qualidade. Do resto o mercado se encarrega.</p><p class="datetime">Em 20/Sep/2004 21:02&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1095739330#comments">Comentários (1)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1095385950">A um ano atr&aacute;s eu teria orgulho disso, mas hoje...</a></h5><p><a href="http://newsbox.msn.com.br/article.aspx?as=article&amp;f=olbrtopnews_-_noticias_-_no-filter&amp;t=12799&amp;id=180395&amp;d=20040916&amp;do=http://newsbox.msn.com.br&amp;i=http://newsbox.msn.com.br/mediaexportlive&amp;ks=0&amp;mc=10&amp;lc=pt&amp;ae=windows-1252">S&atilde;o Paulo ser&aacute; a 2&ordf; maior cidade do mundo em 2005</a></p><p class="datetime">Em 16/Sep/2004 18:52&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1095385950#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1095373078">Somos todos estranhos</a></h5><p>Lendo o <a href="http://weblogs.asp.net/oldnewthing">blog do Raymond Chen</a>, como fa&ccedil;o todos os dias, encontrei <a href="http://weblogs.asp.net/oldnewthing/archive/2004/09/14/229387.aspx">um post muito interessante, comparando a arquitetura x86 com as demais arquiteturas dispon&iacute;veis no mercado</a>. Nesse post ele fala sobre as caracter&iacute;sticas da arquitetura x86, e que muitas delas n&atilde;o s&atilde;o encontradas em outras arquiteturas (como <a href="http://www-306.ibm.com/chips/products/powerpc/">PPC</a>, <a href="http://www.mips.com/">MIPS</a>, <a href="http://en.wikipedia.org/wiki/Alpha_processor">Alpha</a> e <a href="http://www.intel.com/products/server/processors/server/itanium2/">ia64</a>). Como estamos acostumados com a arquitetura do x86, parece que essas arquiteturas s&atilde;o estranhas e ex&oacute;ticas. Mas n&atilde;o s&atilde;o.</p>

<p>Olhando a lista resumida do Raymond, vemos que a arquitetura x86 &eacute; limitada, por manter compatibilidade desde o 8086 (PC XT). E vemos tamb&eacute;m que a nova arquitetura da Intel, a ia64, agora compartilha diversas caracter&iacute;sticas com as outras arquiteturas. Inclusive algo que em termos de performance chega a ser &oacute;bvio, que &eacute; colocar os par&acirc;metros em registradores, e n&atilde;o na pilha. Existe, dois artigos interessante sobre arquitetura ia64 na MSDN Magazine (<a href="http://msdn.microsoft.com/msdnmag/issues/01/06/Hood/default.aspx">aqui</a> e <a href="http://msdn.microsoft.com/msdnmag/issues/01/07/hood/">aqui</a>)</p>

<p>Mais uma prova de que nem sempre o melhor produto &eacute; o que ganha o mercado. O padr&atilde;o Beta sempre foi melhor do que o VHS, mas ningu&eacute;m usa. Essas outras arquiteturas s&atilde;o bem melhores que o x86, mas ningu&eacute;m usa (em desktops).</p><p class="datetime">Em 16/Sep/2004 15:17&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1095373078#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1095241581">Mais uma mudan&ccedil;a de paradigma</a></h5><p>Quando eu comecei a acessar a Internet, em 1997, uma das primeiras coisas que voc&ecirc; aprendia era que voc&ecirc; deveria ser sempre an&ocirc;nimo. Al&eacute;m dos nicks para os chats, a grande maioria das pessoas tinham um e-mail com nick. Eu lembro de um colunista de uma conceituada revista de inform&aacute;tica dizer que criar um e-mail com o pr&oacute;prio nome ou sobrenome era uma falta de criatividade. Hoje sabemos que isso n&atilde;o passa de estupidez.</p>
<p>Um fen&ocirc;meno que eu estou percebendo de um tempo para c&aacute; &eacute; que as pessoas est&atilde;o perdendo o medo da Internet, e ela est&aacute; se tornando menos an&ocirc;nima.</p>
<p>Primeiros foram as p&aacute;ginas pessoais (faz tempo...). Todo mundo queria ter uma p&aacute;gina pessoal, mesmo as pessoas que n&atilde;o tinham muito a dizer. Nem que fosse para colocar quais eram seus passatempos prediletos e onde voc&ecirc; mora. Mas as pessoas eram receosas em colocar o nome completo ou mesmo uma foto, afinal, algu&eacute;m poderia usar essas informa&ccedil;&otilde;es para fins ilegais. L&aacute; as pessoas diziam o primeiro nome e do que gostavam.</p>
<p>Depois, bem depois, vieram os blogs. Al&eacute;m das pessoas colocarem suas prefer&ecirc;ncias na rede, agora as pessoas colocam seu di&aacute;rio e sua opini&atilde;o pessoal tamb&eacute;m. A nova mania s&atilde;o os fotoblogs, onde as pessoas colocam fotos em todas as situa&ccedil;&otilde;es poss&iacute;veis e imagin&aacute;veis. Agora as pessoas publicam sua rotina, com nome, sobrenome, e muitas fotos.</p>
<p>E agora, o Orkut. L&aacute; voc&ecirc; coloca nome, sobrenome, fotos e ainda diz quem &eacute; ou n&atilde;o &eacute; seu amigo. As pessoas participam de f&oacute;runs e discutem diversos assuntos (de sexo a bons bares para tomar chope alem&atilde;o) com o nome estampado e um link para um profile quase sempre bem detalhado. Agora al&eacute;m de tudo isso, voc&ecirc; diz quem s&atilde;o seus amigos, discute suas prefer&ecirc;ncias e gostos abertamente. Coisa que muitas pessoas n&atilde;o fazem nem com os amigos no mundo real. Deixamos de ser an&ocirc;nimos, mas ainda usamos o fato de estar por tr&aacute;s de um computador para dizer coisas que n&atilde;o dir&iacute;amos em outra situa&ccedil;&atilde;o.</p>
<p>E ultimamente, tenho visto que as pessoas entram em f&oacute;rums de discuss&atilde;o usando o pr&oacute;prio nome e colocando um foto verdadeira como avatar. No MSN isso tamb&eacute;m tem sido mais constante.</p>
<p>Eu fico me perguntando o que vir&aacute; depois...</p><p class="datetime">Em 15/Sep/2004 02:46&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1095241581#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1095161277">Parece brincadeira, mas a Microsoft fez</a></h5><p>Parece brincadeira, mas um dia depois de escrever o post tirando sarro do Windows Me (<a href="../../../content.1bit/weblog/1095065518">"Pode acontecer algum dia, em algum computador"</a>), com uma mensagem que pouco provavelmente apareceria em um software comercial, encontrei essa mensagem no Microsoft Word 2003:</p>
<p><center><img src="http://www.1bit.com.br/images/1095161277.png"/></center></p>
<p>Essa mensagem estaria correta se eu n&atilde;o tivesse um browser instalado. Mas o detalhe &eacute; que o link que eu cliquei ("More information about this error message online") foi aberto no <a href="http://getfirefox.com">Firefox</a>, que &eacute; meu browser padr&atilde;o...</p>
<p>Al&eacute;m disso, o Office 2003 s&oacute; roda em Windows 2000 ou superior, o que descarta a possibilidade de n&atilde;o haver um browser instalado.</p>
<p class="datetime">Em 14/Sep/2004 04:27&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1095161277#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1095065518">Pode acontecer algum dia, em algum computador</a></h5><p><b>&lt;sarcasmo&gt;</b></p>
Mensagem de erro mostrada por um programa de instala&ccedil;&atilde;o quando executado no Windows Me :
<p><center><img src="http://www.1bit.com.br/images/1095065518.png"/></center></p>
<p><b>&lt;/sarcasmo&gt;</b></p>
<p>Se ao inv&eacute;s de linguas n&oacute;rdicas, o <a href="http://blogs.msdn.com/oldnewthing">Raymond Chen</a> estivesse estudando portugu&ecirc;s, e ele por acaso lesse meu weblog, ele ficaria muito bravo... :-)</p><p class="datetime">Em 13/Sep/2004 01:51&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1095065518#comments">Comentários (0)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1095065027">Dicas para particionamento e organiza&ccedil;&atilde;o do HD, parte 3</a></h5><p>Como prometido, agora na terceira parte vou explicar um pouco sobre NTFS. Acho desnecess&aacute;rio dizer, mas isso &eacute; s&oacute; o b&aacute;sico sobre os sistemas de arquivos. Caso voc&ecirc; precise de maiores detalhes, procure a especifica&ccedil;&atilde;o ou maiores informa&ccedil;&otilde;es na web.</p>

<p>O NTFS (NT File System) foi criado especialmente para o Windows NT, logo na sua primeira vers&atilde;o. Houve uma grande discuss&atilde;o durante o projeto do Windows NT sobre a viabilidade de criar-se um novo sistema de arquivos ou usar/adaptar um existente na &eacute;poca, como o FAT ou o HPFS. Sabemos hoje a decis&atilde;o que foi tomada.</p>

<p>Os &uacute;nicos sistemas operacionais realmente compat&iacute;veis com NTFS s&atilde;o os da linha Windows NT: Windows NT 3.x, Windows NT 4.0, Windows 2000 (5.0), Windows XP (5.1), Windows Server 2003 (5.2) e a pr&oacute;xima vers&atilde;o, ainda em alfa, Windows Longhorn (6.0). Existem drivers para Linux, mas somente readonly. Para Windows 9x existe o <a href="http://www.sysinternals.com/ntw2k/freeware/ntfswin98.shtml"> NTFS for Windows 98</a> dos nossos geniais amigos da SysInternals, que usa os drivers do Windows NT para acessar as parti&ccedil;&otilde;es NTFS.</p>
<p>Vamos &agrave;s vantagens e desvantagens do NTFS.</p>
<p>Vantagens:</p>

<ul>
<li>NTFS possui journaling, que controla todas as modifica&ccedil;&otilde;es nos metadados da parti&ccedil;&atilde;o. Os metadados s&atilde;o as informa&ccedil;&otilde;es de como e onde est&atilde;o os dados e os arquivos na parti&ccedil;&atilde;o. Todas as modifica&ccedil;&otilde;es s&atilde;o gravadas em um log ANTES de serem efetuadas. Assim, caso um problema (como queda de energia) aconte&ccedil;a durante a grava&ccedil;&atilde;o, &eacute; poss&iacute;vel terminar ou reverter a opera&ccedil;&atilde;o na pr&oacute;xima vez que o computador for ligado. Note que isso garante a integridade da parti&ccedil;&atilde;o, mas n&atilde;o a integridade dos dados. O controle de dados &eacute; deixado por conta da aplica&ccedil;&atilde;o. Os bancos de dados (como SQL Server ou Oracle) fazem controle de integridade de dados;</li>
<li>Possui suporte a metadados para os arquivos e pastas, o que permite, entre outras coisas, que as informa&ccedil;&otilde;es de permiss&atilde;o do arquivo sejam gravadas diretamente na parti&ccedil;&atilde;o. Por isso que voc&ecirc; consegue determinar permiss&otilde;es de acesso em uma parti&ccedil;&atilde;o NTFS, e n&atilde;o em uma parti&ccedil;&atilde;o FAT (usando Windows NT/2000/XP, &eacute; claro);</li>
<li>Possui suporte a streams alternativas. Al&eacute;m de gravar no arquivo, voc&ecirc; pode criar um novo fluxo de dados para o arquivo e gravar informa&ccedil;&otilde;es separadamente. Isso permite, por exemplo, que voc&ecirc; mantenha diferentes vers&otilde;es dos dados do arquivo em streams diferentes;</li>
<li>Tem menos problemas com fragmenta&ccedil;&atilde;o do que o FAT;</li>
<li>Possui suporte nativo a criptografia e compacta&ccedil;&atilde;o (a partir do Windows 2000).</li>
</ul>

<p>Desvantagens:</p>
<ul>
<li>S&oacute; &eacute; 100% compat&iacute;vel com o Windows NT/2000/XP.</li>
</ul>
<p>(tentei encontrar mais desvantagens, mas n&atilde;o achei. Existem boatos de que FAT &eacute; mais r&aacute;pido do que NTFS, mas n&atilde;o achei nenhum estudo realmente conclusivo sobre isso)</p>


<h6>Veja tamb&eacute;m</h6>
<a href="../../../content.1bit/weblog/1091524453">
Dicas para particionamento e organiza&ccedil;&atilde;o do HD, parte 1</a><br>
<a href="../../../content.1bit/weblog/1093571241">
Dicas para particionamento e organiza&ccedil;&atilde;o do HD, parte 2</a><br>
<a href="../../../content.1bit/weblog/1097007424">
Verdades e mitos sobre NTFS e FAT</a><p class="datetime">Em 13/Sep/2004 01:43&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1095065027#comments">Comentários (2)</a></p><h5><a class="weblog_link" href="content.1bit/weblog/1094895091">Como sempre, Carmack nos surpreende</a></h5><p>Existe uma palavra que define Doom3: medo. Al&eacute;m dos gr&aacute;ficos muito bons, que todo mundo fala, o enredo e ambiente do jogo tamb&eacute;m s&atilde;o &oacute;timos. O jogo realmente d&aacute; medo, e eu n&atilde;o consigo jogar mais de uma hora por causa da tens&atilde;o. <a href="http://en.wikipedia.org/wiki/John_Carmack">John Carmack</a> mais uma vez prova que continua sendo um g&ecirc;nio.</p>
<p>Agora vou ler um livro para me acalmar depois de uma sess&atilde;o de Doom3...</p><p class="datetime">Em 11/Sep/2004 02:31&nbsp;-&nbsp;<a href="../../../content.1bit/weblog/1094895091#comments">Comentários (0)</a></p>



































</div>
          </td>
        </tr>

          <tr>
          <td class="topmenu"></td>
          <td>
          <table style="margin: 0px" cellspacing="0" cellpadding="0" width="100%" border="0">
            <tr>
              <td><img src="../../../images/rebarba3.png"></td>
              <td align="right"><img src="../../../images/rebarba4.png"></td>
            </tr>
          </table>
          </td>
        </tr>

<tr><td class="topmenu">&nbsp;</td><td class="topmenu">&nbsp;</td></tr>
<tr><td class="topmenu">&nbsp;</td><td>
<table style="MARGIN: 0px" cellspacing="0" cellpadding="0" width="100%" border="0">
            <tr>
              <td><img src="../../../images/rebarba1.png"></td>
              <td align="right"><img src="../../../images/rebarba2.png"></td>
              </tr>
            </table>
</td>
</tr>
 <tr><td class="topmenu">&nbsp;</td><td >
<div class="content">
<a name="comments"></a><h5>Comentários</h5><div class="comment">
<a href="mailto:blakhalk@ig.com.br">Wanderley Caloni Jr</a>, em  14/08/2004<br/>Muito show todos os posts (at&eacute; agora ehehehehe).<br><br>Parab&eacute;ns pelo site! Fica a cada dia melhor =).<br><br>[]s<br>
</div>
<div class="comment">
<a href="mailto:delneto@hotmail.com">Delmiro Neto</a>, em  08/10/2004<br/>Cara, tem tudo de bom aqu&iacute;.<br><br>Parab&eacute;ns, &eacute; o melhor site em portugu&ecirc;s que eu conhe&ccedil;o. <br><br>L&iacute; tudo... perfeito.<br><br>Parab&eacute;ns mesmo... continue escrevendo.
</div>
<div class="comment">
<a href="mailto:Elcimar.Silva@Molex.com">Elcimar Silva</a>, em  28/10/2004<br/>  Caro Colega.<br><br>  Estou aproveitando o espa&ccedil;o cedido,para pedir ajuda. Aparece um pouco estranho pedir algo no meio de tanta linguagem &quot;avan&ccedil;ada&quot; algo t&atilde;o obsoleto. Pois bem, estou precisando encontrar sites,livros,tutoriais ou algo similar, para a linguagem de programa&ccedil;&atilde;o QBasic (Quick Basic da microsoft). Sei que este linguagem de program&ccedil;&atilde;o &eacute; bastante obsoleta, mais estou precisando muito de encontrar este tipo de informa&ccedil;&atilde;o. Voc&ecirc; poderia ajudar-me?Fico grato por qualquer informa&ccedil;&atilde;o,seja l&aacute; de quem for. Obrigado.
</div>
<div class="comment">
<a href="http://http://www.1bit.com.br">Rodrigo Strauss</a>, em  28/10/2004<br/><a href="http://www.google.com/search?&q=qbasic%20tutorial">http://www.google.com/search?&q=qbasic%20tutorial</a>
</div>



</div>

</td></tr>

















<tr>
          <td class="topmenu"></td>
          <td>
          <table style="margin: 0px" cellspacing="0" cellpadding="0" width="100%" border="0">
            <tr>
              <td><img src="../../../images/rebarba3.png"></td>
              <td align="right"><img src="../../../images/rebarba4.png"></td>
            </tr>
          </table>
          </td>
        </tr>

        <tr>
          <td class="topmenu">&nbsp;</td>
          <td class="topmenu" height="25" align="right">
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          </td>
        </tr>
    </table>
  </body>
</html>















