<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
  <head>
<meta charset="utf-8">
<META NAME="keywords" CONTENT="Rodrigo Strauss, programador, programação, Visual C++, C#, Windbg, Device Driver">
<META NAME="description" CONTENT="Artigos sobre programação escritos por Rodrigo Strauss">
<META NAME="author" CONTENT="Rodrigo Strauss">
<META NAME="ROBOTS" CONTENT="ALL">
    <title>Por que voc&ecirc; programa?  ::::  Rodrigo Strauss :: 1bit</title>
    <link href="../../../1bit.css" type="text/css" rel="stylesheet">
    <link rel="alternate" type="text/xml" title="RSS" href="../../../weblog_rss.1bit">

  </head>
  <body bottommargin="0" leftmargin="0" topmargin="0" rightmargin="0">
    <table cellspacing="0" cellpadding="0" width="100%" border="0">
        <tr>
          <td class="header" valign="middle" bgcolor="#ffffff" height="77" colspan="2">&nbsp;
<a href="../../../"><img src="../../../images/logo_novo_2.png" border="0" /></a>

          </td>
        </tr>
        <tr>
          <td class="topmenu"></td>
          <td class="topmenu" align="right" height="30">

		    <a class="top_menu_link" href="../../../content.1bit/contact">Contato</a> 
			<span class="menusep">|</span>
            
            <a class="top_menu_link" href="../../../content.1bit/about">Sobre...</a>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          </td>
        </tr>
        <tr>
          <td class="topmenu"></td>
          <td>
          <table style="MARGIN: 0px" cellspacing="0" cellpadding="0" width="100%" border="0">
            <tr>
              <td><img src="../../../images/rebarba1.png"></td>
              <td align="right"><img src="../../../images/rebarba2.png"></td>
              </tr>
            </table>
          </td>
        </tr>
        <tr>
          <td class="menu" valign="top" width="175">

<div class="left_menu_section">
 <h2><a href="../../../#artigos" style="text-decoration:none;">Artigos</a></h2>
</div>

<div class="left_menu_section">
 <h2><a href="../../../content.1bit/weblog_archive" style="text-decoration:none;">Blog</a></h2>
</div>

<div class="left_menu_section">
 <h2><a href="../../../content.1bit/opensource" style="text-decoration:none;">Open Source</a></h2>
</div>

<!-- 
<div class="left_menu_section">
 <h2><a href="content.1bit/aulas" style="text-decoration:none;">Aulas online (ou não) </a></h2>
</div>
-->


<br>
<br>
<br>
<center>

<!--
<a href="http://whos.amung.us/show/xopqoakh"><img src="http://whos.amung.us/cwidget/xopqoakh/fffffff6915a.png" alt="page counter" width="81" height="29" border="0" /></a>
-->

</center>



<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
          </td>
          <td valign="top">
<div class="content">
<table width="100%" border="0">
<tr>
<td>
<h4><a href="../../../content.1bit/weblog_archive" style="text-decoration:none;">Rodrigo Strauss :::: WebLog</a></h4>
</td>

<td align="right">
<a style="text-decoration:none;" href="../../../content.1bit/weblog_archive">Arquivo</a><br><br>
<a style="text-decoration:none;" href="../../weblog_rss.1bit"><img src="../../../images/xml.gif" border="0"/></a>

</td>

</tr>
</table>
<h5>Por que voc&ecirc; programa?</h5><p>Tentando encontrar uma forma de explicar para um entrevistador como eu sou fascinado por programa&ccedil;&atilde;o sem parecer mentiroso ou artificial, eu me lembrei de uma coisa que li a muito tempo atr&aacute;s: <a href="http://neopoleon.com/blog/posts/408.aspx">"Why Do You Code?"</a>.</p>
<p>Precisa existir algum motivo l&oacute;gico? No meu caso &eacute; simplesmente inexplic&aacute;vel, quase uma doen&ccedil;a. Caso algu&eacute;m queira tentar fazer um diagn&oacute;stico, vou enumerar alguns sintomas:</p>
<ul>
<li>Meu micro tem 512MB de RAM e uma Geforce FX 5200 128MB. Eu at&eacute; fico feliz que minha m&aacute;quina rode <a href="http://www.doom3.com">Doom3</a> numa velocidade razo&aacute;vel, mas esse n&atilde;o &eacute; motivo da minha felicidade. Eu fico feliz porque posso abrir duas m&aacute;quinas virtuais, o Visual Studio.NET, a MSDN, o Firefox com milhares de tabs e o WinDbg ao mesmo tempo.</li>

<li>Eu trabalho com programa&ccedil;&atilde;o o dia inteiro. Sabe o que eu fa&ccedil;o pra me divertir quando chego em casa? Abro meu Visual C++ e trabalho em um software que eu estou fazendo a 10 meses, envolvendo computa&ccedil;&atilde;o distribu&iacute;da e device drivers. Ou seja, continuo programando e estudando.</li>

<li>Fico feliz pelo fato da minha HD ter 120GB. Assim eu posso instalar sem preocupa&ccedil;&atilde;o a MSDN, o DDK, o Platform SDK, o Visual Studio 6, o Visual Studio.NET, posso baixar milhares de fontes do <a href="http://www.sourceforge.net">Source Forge</a>, criar v&aacute;rias m&aacute;quinas virtuais para testar softwares como o Visual Studio 2005, Yukon e sistemas operacionais, posso instalar Linux ou at&eacute; mesmo o Longhorn em outra parti&ccedil;&atilde;o, etc, etc.</li>

<li>Fico feliz por ganhar um sal&aacute;rio bom. Assim eu posso gastar dinheiro comprando mais livros sobre programa&ccedil;&atilde;o todo m&ecirc;s na Amazon.</li>

<li>Se hoje eu tenho um bom conhecimento de ingl&ecirc;s, &eacute; de tanto ler livros sobre programa&ccedil;&atilde;o e aperfei&ccedil;oar o ingl&ecirc;s para estudar mais sobre programa&ccedil;&atilde;o e para trabalhar em projetos envolvendo programa&ccedil;&atilde;o no exterior. Um dia um amigo me disse que queria virar programador e perguntou por onde come&ccedil;ar. Eu disse para come&ccedil;ar estudando ingl&ecirc;s.</li>

</ul>

<p>Essa mat&eacute;ria que eu citei conta a hist&oacute;ria de um sujeito que queria aprender a programar mas n&atilde;o tinha micro, s&oacute; uma WebTV (um finado aparelho no qual voc&ecirc; podia navegar pela web com s&eacute;rias limita&ccedil;&otilde;es e enviar/receber e-mails ligando o aparelho &agrave; linha telefonica e &agrave; TV, quase um TK90X). Ent&atilde;o ele escrevia os fontes C em um e-mail, e enviava para um amigo que tinha computador. Esse amigo compilava e mandava os erros de volta. Assim ele come&ccedil;ou a programar.</p>
<p>Esse sujeito parece maluco? Pois &eacute;, mas eu comecei mais ou menos assim. Eu aprendi a programar com 12 anos, quando minha m&acirc;e trabalhava na UNESP de Botucatu e eu resolvi fu&ccedil;ar em computadores no polo computacional de l&aacute;. Depois eu resolvi pegar uns livros para ler. O que voc&ecirc; faria se visse um garoto de 12 anos de idade na biblioteca da sua faculdade procurando livros de programa&ccedil;&atilde;o? Hoje eu fico imaginando como devia ser estranho...</p>
<p>Ent&atilde;o eu peguei um livro de BASIC e comecei a programar em GW-BASIC usando os micro de l&aacute;. Mas eu n&atilde;o tinha micro em casa, n&atilde;o podia programar sempre. N&atilde;o demorou muito tempo para que eu come&ccedil;asse a escrever programas em um caderno, na minha casa. Eu tinha 12 anos de idade...</p>
<p>Tem alguma explica&ccedil;&atilde;o para isso? Existem pessoas que programam para viver, e pessoas que vivem para programar. Eu me encaixo na segunda categoria, e conhe&ccedil;o algumas pessoas assim.</p>
<p>Por que eu programo? Sinceramente, eu n&atilde;o sei explicar. S&oacute; espero que o entrevistador entenda...</p><br><p class="datetime">Em 19/Aug/2004 01:18</p>































</div>
          </td>
        </tr>

          <tr>
          <td class="topmenu"></td>
          <td>
          <table style="margin: 0px" cellspacing="0" cellpadding="0" width="100%" border="0">
            <tr>
              <td><img src="../../../images/rebarba3.png"></td>
              <td align="right"><img src="../../../images/rebarba4.png"></td>
            </tr>
          </table>
          </td>
        </tr>

<tr><td class="topmenu">&nbsp;</td><td class="topmenu">&nbsp;</td></tr>
<tr><td class="topmenu">&nbsp;</td><td>
<table style="MARGIN: 0px" cellspacing="0" cellpadding="0" width="100%" border="0">
            <tr>
              <td><img src="../../../images/rebarba1.png"></td>
              <td align="right"><img src="../../../images/rebarba2.png"></td>
              </tr>
            </table>
</td>
</tr>
 <tr><td class="topmenu">&nbsp;</td><td >
<div class="content">
<a name="comments"></a><h5>Comentários</h5><div class="comment">
<a href="mailto:fabricioferreira@msn.com">Fabrício Ferreira</a>, em  18/10/2004<br/>Hehehehe...Esse sou eu!
</div>



</div>

</td></tr>














<tr>
          <td class="topmenu"></td>
          <td>
          <table style="margin: 0px" cellspacing="0" cellpadding="0" width="100%" border="0">
            <tr>
              <td><img src="../../../images/rebarba3.png"></td>
              <td align="right"><img src="../../../images/rebarba4.png"></td>
            </tr>
          </table>
          </td>
        </tr>

        <tr>
          <td class="topmenu">&nbsp;</td>
          <td class="topmenu" height="25" align="right">
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          </td>
        </tr>
    </table>
  </body>
</html>














